Revit 2024 API
DirectShapeReferencingOption Enumeration
 An enumerated type containing possible referencing options for DirectShapes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Since: 2016
Syntax
C#
public enum DirectShapeReferencingOption
Visual Basic
Public Enumeration DirectShapeReferencingOption
Visual C++
public enum class DirectShapeReferencingOption
Members
Member name | Description
NotReferenceable |  The associated DirectShape shall not be referenceable.
Referenceable |  The associated DirectShape may be dimensioned and/or otherwise referenced.
See Also
Autodesk.Revit.DB Namespace